
//
//
Функция ПолучитьНастройкиTelegram()
	
	СтруктураНастроек = Новый Структура();
	
	СтруктураНастроек.Вставить("Bot", "");
	СтруктураНастроек.Вставить("Token", "");
	СтруктураНастроек.Вставить("Api", "");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Telegram_Настройки.Bot КАК Bot,
	                      |	Telegram_Настройки.Api КАК Api,
	                      |	Telegram_Настройки.Token КАК Token
	                      |ИЗ
	                      |	РегистрСведений.Telegram_Настройки КАК Telegram_Настройки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		
	КонецЕсли;
	
	Возврат Выборка;
	
КонецФункции